app/views/answers/_answers.html.erb

<% current_time = DateTime.now %>
<% @question.answers.all.order("created_at DESC").each do |answer| %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ? ORDER BY created_at DESC  [["question_id", 1]]

	 		<h2> Average rating </h2>
	 		<% if answer.reviews.blank? %>
	 			<div class="average-review-rating" data-score=<%= 0 %>></div>
	 			<span>Based on <%= answer.reviews.count %> reviews </span>
	 		<% else %>
				<div class="average-review-rating" data-score=<%= answer.reviews.average(:rating).present? ? answer.reviews.average(:rating).round(2) : 0%>>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."answer_id" = ?  [["answer_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."answer_id" = ?  [["answer_id", 1]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."answer_id" = ?  [["answer_id", 1]]

		<div>
			<% review = answer.reviews.find_by(user_id: current_user.id) %>
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."answer_id" = ? AND "reviews"."user_id" = ? LIMIT ?  [["answer_id", 1], ["user_id", 1], ["LIMIT", 1]]