app/controllers/answers_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "answers" ("body", "question_id", "created_at", "updated_at", "user_id", "name") VALUES (?, ?, ?, ?, ?, ?)  [["body", "New Delhi"], ["question_id", 1], ["created_at", "2017-11-12 06:22:18.276901"], ["updated_at", "2017-11-12 06:22:18.276901"], ["user_id", 1], ["name", "Nikhil"]]
---
	def create
		@question = Question.find(params[:question_id])
		@answer = @question.answers.create(answer_params)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT  "answers".* FROM "answers" WHERE "answers"."question_id" = ? AND "answers"."id" = ? LIMIT ?  [["question_id", 9], ["id", 7], ["LIMIT", 1]]
DELETE FROM "answers" WHERE "answers"."id" = ?  [["id", 7]]
---
	def destroy
		@question = Question.find(params[:question_id])
		@answer = @question.answers.find(params[:id])
		@answer.destroy