app/controllers/questions_controller.rb

SELECT  "questions".* FROM "questions" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 7], ["OFFSET", 0]]
SELECT COUNT(*) FROM "questions"
---
	def index
		@questions = Question.all.order("created_at DESC").paginate(page: params[:page], per_page: 7)

INSERT INTO "questions" ("created_at", "updated_at", "description", "user_id", "name") VALUES (?, ?, ?, ?, ?)  [["created_at", "2017-11-12 09:41:50.127149"], ["updated_at", "2017-11-12 09:41:50.127149"], ["description", "What is the capital of USA?\r\n"], ["user_id", 1], ["name", "Nikhil"]]
INSERT INTO "answers" ("body", "question_id", "created_at", "updated_at", "user_id", "name") VALUES (?, ?, ?, ?, ?, ?)
---
	def create
		#render plain: params[:post].inspect
		if(current_user)
			@question = Question.new(question_params.merge(user_id: current_user.id, name: current_user.name))
		else
			@question = Question.new(question_params.merge(user_id: 1, name: session[:omniauth]['info']['name']))
		end
		if(@question.save)
			uri = URI('http://127.0.0.1:5000/stuff')
			response = Net::HTTP.post_form(uri, 'question' => @question.qtext, 'text' => @question.description)
			result = JSON.parse(response.body)
			result.to_s
			puts result
			if (current_user)
				@answer = @question.answers.create(body: result, user_id: 1, name: "deepqa")