app/controllers/reviews_controller.rb

	def create
		@review = Review.new(review_params)
		@review.answer_id = @answer.id
		if current_user
			@review.user_id = current_user.id
		elsif session[:omniauth]
			@review.user_id = 1
		end
		if @review.save
---
INSERT INTO "reviews" ("rating", "created_at", "updated_at", "user_id", "answer_id") VALUES (?, ?, ?, ?, ?)  [["rating", 3], ["created_at", "2017-11-12 06:22:36.875889"], ["updated_at", "2017-11-12 06:22:36.875889"], ["user_id", 1], ["answer_id", 1]]

	def update
		@review = Review.find(params[:id])

		if @review.update(review_params)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "reviews" SET "rating" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["rating", 5], ["updated_at", "2017-11-12 09:33:32.275565"], ["id", 3]]

		def find_answer
			@answer = Answer.find(params[:answer_id])
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

		def find_review
			@review = Review.find(params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]